// =============================================================================
// Module: barrel_rotater
// Description: バレルローテータ (Barrel Rotater)
//   - 入力のビットを指定された回転量だけ回転させる組み合わせ回路
//   - 入力: l_r (回転方向), in (回転させるデータ), shift (回転量)
//   - 出力: result (回転後のデータ)
// =============================================================================

module barrel_rotater (
    input  l_r, // 回転方向 (0: 左回転, 1: 右回転)
    input  [7:0] in, // 回転させるデータ
    input  [2:0] shift, // 回転量 (0-7)
    output  [7:0] result // 回転後のデータ
);

    assign result = (l_r == 0) ? ({in, in} << shift)[15:8] : ({in, in} >> shift)[7:0]; // l_rに基づいて出力を選択

endmodule